rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_A7_PAD_0_MASK           (0x3U)
#define VIRT_WRAPPER_REG_A7_PAD_0_SHIFT          (0U)
#define VIRT_WRAPPER_REG_A7_PAD_0_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A7_PAD_0(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A7_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A7_PAD_1_MASK           (0xCU)
#define VIRT_WRAPPER_REG_A7_PAD_1_SHIFT          (2U)
#define VIRT_WRAPPER_REG_A7_PAD_1_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A7_PAD_1(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A7_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A7_PAD_1_MASK)
/*! @} */

/*! @name REG_A8 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A8_PAD_0_MASK           (0x3U)
#define VIRT_WRAPPER_REG_A8_PAD_0_SHIFT          (0U)
#define VIRT_WRAPPER_REG_A8_PAD_0_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_0(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_0_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_1_MASK           (0xCU)
#define VIRT_WRAPPER_REG_A8_PAD_1_SHIFT          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_1_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_1(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_1_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_1_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_2_MASK           (0x30U)
#define VIRT_WRAPPER_REG_A8_PAD_2_SHIFT          (4U)
#define VIRT_WRAPPER_REG_A8_PAD_2_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_2(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_2_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_2_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_3_MASK           (0xC0U)
#define VIRT_WRAPPER_REG_A8_PAD_3_SHIFT          (6U)
#define VIRT_WRAPPER_REG_A8_PAD_3_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_3(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_3_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_3_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_6_MASK           (0x3000U)
#define VIRT_WRAPPER_REG_A8_PAD_6_SHIFT          (12U)
#define VIRT_WRAPPER_REG_A8_PAD_6_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_6(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_6_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_6_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_7_MASK           (0xC000U)
#define VIRT_WRAPPER_REG_A8_PAD_7_SHIFT          (14U)
#define VIRT_WRAPPER_REG_A8_PAD_7_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_7(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_7_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_7_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_8_MASK           (0x30000U)
#define VIRT_WRAPPER_REG_A8_PAD_8_SHIFT          (16U)
#define VIRT_WRAPPER_REG_A8_PAD_8_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_8(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_8_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_8_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_9_MASK           (0xC0000U)
#define VIRT_WRAPPER_REG_A8_PAD_9_SHIFT          (18U)
#define VIRT_WRAPPER_REG_A8_PAD_9_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A8_PAD_9(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_9_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_9_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_10_MASK          (0x300000U)
#define VIRT_WRAPPER_REG_A8_PAD_10_SHIFT         (20U)
#define VIRT_WRAPPER_REG_A8_PAD_10_WIDTH         (2U)
#define VIRT_WRAPPER_REG_A8_PAD_10(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_10_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_10_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_11_MASK          (0xC00000U)
#define VIRT_WRAPPER_REG_A8_PAD_11_SHIFT         (22U)
#define VIRT_WRAPPER_REG_A8_PAD_11_WIDTH         (2U)
#define VIRT_WRAPPER_REG_A8_PAD_11(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_11_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_11_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_12_MASK          (0x3000000U)
#define VIRT_WRAPPER_REG_A8_PAD_12_SHIFT         (24U)
#define VIRT_WRAPPER_REG_A8_PAD_12_WIDTH         (2U)
#define VIRT_WRAPPER_REG_A8_PAD_12(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_12_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_12_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_13_MASK          (0xC000000U)
#define VIRT_WRAPPER_REG_A8_PAD_13_SHIFT         (26U)
#define VIRT_WRAPPER_REG_A8_PAD_13_WIDTH         (2U)
#define VIRT_WRAPPER_REG_A8_PAD_13(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_13_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_13_MASK)

#define VIRT_WRAPPER_REG_A8_PAD_15_MASK          (0xC0000000U)
#define VIRT_WRAPPER_REG_A8_PAD_15_SHIFT         (30U)
#define VIRT_WRAPPER_REG_A8_PAD_15_WIDTH         (2U)
#define VIRT_WRAPPER_REG_A8_PAD_15(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A8_PAD_15_SHIFT)) & VIRT_WRAPPER_REG_A8_PAD_15_MASK)
/*! @} */

/*! @name REG_A9 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_A9_PAD_0_MASK           (0x3U)
#define VIRT_WRAPPER_REG_A9_PAD_0_SHIFT          (0U)
#define VIRT_WRAPPER_REG_A9_PAD_0_WIDTH          (2U)
#define VIRT_WRAPPER_REG_A9_PAD_0(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_A9_PAD_0_SHIFT)) & VIRT_WRAPPER_REG_A9_PAD_0_MASK)
/*! @} */

/*! @name REG_B0 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B0_INMUX_0_MASK         (0x3U)
#define VIRT_WRAPPER_REG_B0_INMUX_0_SHIFT        (0U)
#define VIRT_WRAPPER_REG_B0_INMUX_0_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B0_INMUX_0(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B0_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B0_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B0_INMUX_1_MASK         (0xCU)
#define VIRT_WRAPPER_REG_B0_INMUX_1_SHIFT        (2U)
#define VIRT_WRAPPER_REG_B0_INMUX_1_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B0_INMUX_1(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B0_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B0_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B0_INMUX_2_MASK         (0x30U)
#define VIRT_WRAPPER_REG_B0_INMUX_2_SHIFT        (4U)
#define VIRT_WRAPPER_REG_B0_INMUX_2_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B0_INMUX_2(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B0_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B0_INMUX_2_MASK)
/*! @} */

/*! @name REG_B1 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B1_INMUX_0_MASK         (0x3U)
#define VIRT_WRAPPER_REG_B1_INMUX_0_SHIFT        (0U)
#define VIRT_WRAPPER_REG_B1_INMUX_0_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B1_INMUX_0(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B1_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B1_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B1_INMUX_1_MASK         (0xCU)
#define VIRT_WRAPPER_REG_B1_INMUX_1_SHIFT        (2U)
#define VIRT_WRAPPER_REG_B1_INMUX_1_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B1_INMUX_1(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B1_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B1_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B1_INMUX_2_MASK         (0x30U)
#define VIRT_WRAPPER_REG_B1_INMUX_2_SHIFT        (4U)
#define VIRT_WRAPPER_REG_B1_INMUX_2_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B1_INMUX_2(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B1_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B1_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B1_INMUX_3_MASK         (0xC0U)
#define VIRT_WRAPPER_REG_B1_INMUX_3_SHIFT        (6U)
#define VIRT_WRAPPER_REG_B1_INMUX_3_WIDTH        (2U)
#define VIRT_WRAPPER_REG_B1_INMUX_3(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B1_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B1_INMUX_3_MASK)

